In [37]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [26]:
a = [3,2,5,72,21,68,23,5,73,256,22,56,90]

# Replace 90 with name

In [21]:
a[a.index(90)] = 'sainath'

In [22]:
a

[3, 2, 5, 72, 21, 68, 23, 5, 73, 256, 22, 56, 'sainath']

###  apply append operation with example

In [23]:
a.append(69)
a

[3, 2, 5, 72, 21, 68, 23, 5, 73, 256, 22, 56, 'sainath', 69]

### apply extend operation with your own example

In [24]:
a.extend([89, 29, 283])
a

[3, 2, 5, 72, 21, 68, 23, 5, 73, 256, 22, 56, 'sainath', 69, 89, 29, 283]

# 2) Create the data Frame using dictionary for 5 countries and their capital?

In [28]:
d = {
    'Countries':['India', 'Australia', 'France', 'Japan', 'China'],
    'Capital':['New Delhi', 'Sydney', 'Paris', 'Tokyo', 'Beijeing']
}
df = pd.DataFrame(d)
df

   Countries    Capital
0      India  New Delhi
1  Australia     Sydney
2     France      Paris
3      Japan      Tokyo
4      China   Beijeing

# 3)Create the Data Frame using List with your name, roll no, marks for three subjects?

In [30]:
d2 = [['Sai', 86, 90, 100, 78],
      ['Abi', 2, 76, 23, 87],
      ['Ansh', 8, 0, 0, 76]]
df2 = pd.DataFrame(d2, columns=['Name', 'Roll No', 'M2', 'AP', 'BEEE'])
df2

   Name  Roll No  M2   AP  BEEE
0   Sai       86  90  100    78
1   Abi        2  76   23    87
2  Ansh        8   0    0    76

# Missing Values

In [40]:
d3 = [['Sai', NA, 90, 100, 78],
      ['Abi', 2, 76, 23, 87],
      ['Ansh', NA, 0, 0, 76]]
df3 = pd.DataFrame(d3, columns=['Name', 'Roll No', 'M2', 'AP', 'BEEE'])
df3

   Name  Roll No  M2   AP  BEEE
0   Sai      NaN  90  100    78
1   Abi      2.0  76   23    87
2  Ansh      NaN   0    0    76

In [45]:
df3.set_index('Name', inplace=True)
df3

      Roll No  M2   AP  BEEE
Name
Sai       NaN  90  100    78
Abi       2.0  76   23    87
Ansh      NaN   0    0    76

In [65]:
df3[df3.isna().sum(axis=1).astype(bool)]

      Roll No  M2   AP  BEEE
Name
Sai       NaN  90  100    78
Ansh      NaN   0    0    76

In [75]:
s = '\nHello'
print(r'\n hello')

\n hello

In [76]:
import re

In [78]:
text = 'abcdefABCDEFabc'
pattern = re.compile(r'abc')
matches = pattern.finditer(text)
for i in matches:
    print(i)

<re.Match object; span=(0, 3), match='abc'>
<re.Match object; span=(12, 15), match='abc'>

In [84]:
sti = '''
321-555-4321
123.555.1234
123*555*4352
'''

pattern = re.compile(r'\d\d\d.\d\d\d.\d\d\d\d')
matches = pattern.finditer(sti)
for i in matches:
    print(i)

<re.Match object; span=(1, 13), match='321-555-4321'>
<re.Match object; span=(14, 26), match='123.555.1234'>
<re.Match object; span=(27, 39), match='123*555*4352'>

In [100]:
persons = '''
Mr. Schafer
Mr smith
Mr davis
Mrs. Robinson
Mr. T
'''
pattern = re.compile(r'Mr\.?\s[A-z]/w+')
matches = pattern.finditer(persons)
for i in matches:
    print(i)